export default ({
  or: 'или',
  email: 'Почта',
  password: 'Пароль',
  requiredPassword: 'Пароль обязателен',
  requiredEmail: 'Почта обязательна',
  newPassword: 'Новый пароль',
  regNew: 'Создать новый аккаунт',
  repeatPassword: 'Повторить пароль',
  incorrectPassword: 'Пароль не совпадает',
  create: 'Создать',
  update: 'Обновить',
  offline: 'Интернет байланышы жок',
  footer: {
    home: 'Үй',
    products: 'Товарлар',
    statistic: 'Отчеттор',
    bucket: 'Араба',
  },
  auth: {
    title: 'Авторизация',
    btn: 'Вход',
    google: 'Google менен кириңиз',
    forgot: 'Забыли пароль?',
    success: 'Вы вошли в систему',
    error: 'Логин или пароль не верный',
  },
  register: {
    title: 'Регистрация',
    submit: 'Создать',
    success: 'Аккаунт почти создан!',
    error: 'Не удалось создать аккаунт. Попробуйте позже!',
    confirm: {
      title: 'Подтверждение почты',
      descr: 'На почту <b>{email}</b> отправлена ссылка, пройдя по которой вы сможете завершить регистрацию. Пожалуйста, проверьте почту.',
      btn: 'Вернуться на стр авторизации'
    }
  },
  forgot: {
    title: 'Забыли пароль?',
    descr: 'Указав почту ниже, вам будет отправлена ссылка, пройдя по которой вы сможете сбросить пароль.',
    btn: 'Отправить',
    error: 'Ошибка при отправки письма. Попробуйте позже.'
  },
  reset: {
    title: 'Обновление пароля',
    btn: 'Обновить',
    success: 'Пароль успешно обновлён!',
    incorrectLink: 'Ссылка не корректная. Отсутствует ключ code в URL.',
    error: 'Не удалось обновить пароль. Попробуйте позже!',
  },
  mainSettings: {
    userTab: {
      title: 'Профиль',
      lang: 'Тилди тандоо',
      info: 'Маалымат',
      wallet: {
        title: 'Кошелек',
      },
      user: {
        fullnameTitle: 'Толук атын жаңыртыңыз',
        fullnamePlaceholder: 'Толук аты',
        success: 'Профиль успешно обнавлен',
        error: 'Ошибка при обновлении профиля. Попробуйте позже!',
      },
      theme: {
        title: 'Тиркеменин темасы',
        light: 'Жарык тема',
        dark: 'Карангы тема'
      },
      logout: 'Чыгуу',
    },
    sizesTab: {
      title: 'Размеры',
      sizesSettings: {
        title: 'Настроить размеры',
        modal: {
          inputNameLabel: 'Название',
          inputNameHint: 'Например: Размеры для обуви',
          inputSizesLabel: 'Список размеров',
          inputSizesHint: 'Указывать через запятую. Например: 36, 37, 38...'
        }
      },
    },
    printTab: {
      title: 'Печать',
      connect: {
        title: 'Подключение к принтеру',
        noPrinters: 'Нет подключенных устройств'
      }
    },
  },
  permissions: {
    p_1: 'Тарых бетин көрүү',
    p_2: 'Баптаулар бетин көрүү',
    p_3: 'Чыгымдар бетин көрүү',
    p_4: 'Отчеттор бетин көрүү',
    p_5: 'Опт баасын көрүү',
    p_6: 'Калдык бетин көрүү',
    p_7: 'Отчеттор: Таза киреше блогу',
    p_8: 'Отчеттор: таблицадагы башкаруу баскычтары',
    p_9: 'Отчеттор: Каржы блогу',
    p_10: 'Товардын өчүрүү',
    p_11: 'Товардын сатуу',
    p_12: 'Товардын кошуу',
    p_13: 'Товардын жаңыртуу',
    p_14: 'Чыгымдарды кошуу',
    p_15: 'Категорияларды кошуу',
    p_16: 'Категорияларды жаңыртуу'
  },
  BleEditorDialog_10: 'Принтердин милдеттүү жөндөөлөрү',
  BleEditorDialog_18: 'Дюймдагы чекиттердин саны (DPI) *',
  BleEditorDialog_20: 'Принтердин документациясында көрсөтүлгөн',
  BleEditorDialog_22: 'Бул талааны толтуруу зарыл',
  BleEditorDialog_29: 'Туурасы *',
  BleEditorDialog_30: 'Иш аймагынын туурасы мм менен',
  BleEditorDialog_33: 'Бул талааны толтуруу зарыл',
  BleEditorDialog_40: 'Кошумча жөндөөлөр',
  BleEditorDialog_46: 'Бийиктик',
  BleEditorDialog_47: 'Иш аймагынын бийиктиги мм менен',
  BleEditorDialog_54: 'Барактын четинен аралык мм менен',
  BleEditorDialog_56: 'Барактын четинен аралыкты калибрлөө үчүн'
})
